{"recipes":[{"Id":0,"Title":"Fried Fish","Image":"https://photo2.foodgawker.com/wp-content/uploads/2015/02/2122427.jpg","Ingredients":"1 pomfret, 10 tablespoons of oil","Instructions":"Heat oil for 2 minutes. Fry fish in oil for 7 minutes per side. Take it out. Serve.","CreateDate":"02-01-2019"},{"Id":1,"Image":"https://4scoin37ye-flywheel.netdna-ssl.com/wp-content/uploads/2018/09/sambalspamfriedrice-250x250.jpg","Title":"Spam Fried Rice","Ingredients":"1/2 tsp + 1 tbsp cooking oil, 2 eggs lightly beaten, 15g unsalted butter, 4 cloves garlic minced, 4 shallots thinly sliced, 1 finger-length red chilli de-seeded & sliced thinly, half can (170g) spam (luncheon meat) cubed, 400g cooked white rice refrigerated overnight, 100g frozen mixed veg (corn, pea, carrot) thawed chopped, coriander/spring onions to garnish, 2 small limes halved","Instructions":"Grease wokpan with 1/2 tsp oil. Pour the egg into the pan to cook on both sides until the egg is set. Cut the egg to small squares when cooled. Set aside. Add and heat remaining oil to the existing wokpan. Add garlic, shallot and red chilli. Stir-fry until the shallot turns translucent, then add spam cubes. Stir-fry quickly until the spam is aromatic and starts to brown. Add mixed veg and cooked egg to the wok. Stir-fry for another 2 minutes. To serve, garnish with coriander/spring onions and lime.","CreateDate":"04-01-2019","EditDate":"04-01-2019"},{"Id":2,"Image":"https://4scoin37ye-flywheel.netdna-ssl.com/wp-content/uploads/2017/06/9F5C2298.jpg","Title":"Shrimp Pasta","Ingredients":"140 grams pasta (angel hair), 12 medium shrimps (tiger prawns) peeled & patted dry, 1 tbsp olive oil, 10 grams unsalted butter, sea salt, freshly cracked black pepper","Instructions":"In a pot of boiling water with 1 tsp salt added until al dente (usually minus 30 seconds off recommended time in packaging instructions for angel hair). Drain pasta. Reserve half a cup of pasta cooking water. Heat pan with olive oil and butter. Season shrimps with salt and black pepper, then arrange one layer on the pan. Allow one side to lightly sear before flipping over to the other side using kitchen tongs. When both sides of the shrimps are browned, turn off the heat. Add cooked pasta and avocado sauce to the pan of cooked shrimps. Toss to coat evenly, adding 1 or more tbsp pasta water to bind everything together. Season with salt and pepper.","CreateDate":"04-01-2019"},{"Id":3,"Image":"https://4scoin37ye-flywheel.netdna-ssl.com/wp-content/uploads/2018/08/blueberryovernightoats3-250x250.jpg","Title":"Blueberry Overnight Oats Recipe","Ingredients":"1/3 cup fresh blueberries for topping the oats, 1/2 cup (50g) rolled oats 1/4 cup (65g) Greek or plain yoghurt 3/4 cup (100ml) unsweetened milk (soy or cow’s milk) 2 tsp chia seeds 2 tbsp (no sugar added) blueberry jam to taste; reduce if eating low-carb","Instructions":"n a glass jug, combine all ingredients, stir to mix well or cover with lid and shake vigorously. Chill in the fridge over night (or at least 6 hours) and keeps up to a week.","CreateDate":"04-01-2019"},{"Id":4,"Title":"Boiled Duck","Image":"https://previews.123rf.com/images/touchman/touchman1102/touchman110200038/8825956-boil-chicken-and-boiled-duck.jpg","Ingredients":"1 duck, 800ml water","Instructions":"Boil duck in water for 20 minutes. Take it out. Serve.","CreateDate":"01-01-2019","EditDate":"03-01-2019"},{"Id":5,"Image":"https://4scoin37ye-flywheel.netdna-ssl.com/wp-content/uploads/2018/11/tomatoeggdropsoup-768x576.jpg","Title":"Tomato Egg Drop Soup","Ingredients":"2 ripe & sweet tomatoes (about 200g) diced, 450ml water cornstarch slurry, 1 tbsp corn starch dissolved in 2 tbsp water, 1 egg beaten, 3/4 tsp fine sea salt to taste, 1/8 dashes white pepper powder to taste, 1 tsp sesame oil to taste, 2 handfuls chopped coriander","Instructions":"In a pot, add diced tomato and water. Bring to a boil. Cover the pot with lid and simmer for 3 minutes. Thicken with cornstarch slurry until the soup thickens to your liking (you don’t have to use all of the slurry). Bring the soup to a boil again. Add in the beaten egg while stirring the soup in one circular direction around the pot. When the egg strands are set, season the soup to taste with salt, white pepper and sesame oil. While the soup is still piping hot, add chopped coriander and serve.","CreateDate":"04-01-2019"},{"Id":6,"Image":"https://4scoin37ye-flywheel.netdna-ssl.com/wp-content/uploads/2018/08/tweggplantsalad-768x576.jpg","Title":"Taiwanese Eggplant Salad","Ingredients":"200 grams eggplant (brinjal or aubergine) cut to 4-cm sections, 2 tsp soy sauce, 1 tsp sesame oil, 1 tsp cold drinking water, 2 garlic cloves minced, 1/2 tsp ginger juice, 1/2 tsp fine sugar, 1-2 chilli padi# deseeded & diced to taste, 1 tbsp chopped coriander or spring onions","Instructions":"Cook the eggplants using either the microwave, boiling or steaming method. Set aside. Combine the other ingredients in a small bowl. Mix well. Arrange cooked eggplant in a serving dish skin-side up and drizzle the sauce over.","CreateDate":"04-01-2019"},{"Id":7,"Image":"https://4scoin37ye-flywheel.netdna-ssl.com/wp-content/uploads/2018/12/steamedsardinesintomato3-250x250.jpg","Title":"Steamed Sardines in Tomato Sauce","Ingredients":"50g red/white onion cut to half moon thin slices, 1 can (155g) sardines in tomato sauce, 1 tbsp tomato ketchup to taste, 2 chilli padi sliced diagonally to small sections, 1 small tomato cut to 6 wedges, 1 small limes halved, 1/2 tbsp chopped spring onions to garnish","Instructions":"Line a steaming dish with onions. Empty the can of sardines (including the tomato sauce) and add ketchup over the onions. Top with sliced chilli and tomato wedges. Steam the dish for 5-12 minutes, depending on how soft you like your cooked onions and tomatoes. To serve, stir with a spoon to evenly mix the sauce. Squeeze lime juice over the steamed sardines and garnish with spring onions.","CreateDate":"04-01-2019"}]}
