{"recipes":[{"title":"Szechuan Shrimp","name":"cooked shrimp","amount":"12 ounces ","notes":"tails removed","nameTwo":"garlic","amountTwo":"4 cloves","notesTwo":"minced","nameThree":"water","amountThree":"4 tbsp","notesThree":"","instructions":"In a bowl, stir together water, ketchup, soy sauce, cornstarch, honey, crushed red pepper, and ground ginger. Set aside.\r\nHeat oil in a large skillet over medium-high heat. Stir in green onions and garlic; cook 30 seconds. Stir in shrimp, and toss to coat with oil. Stir in sauce. Cook and stir until sauce is bubbly and thickened.","image":"https://thewoksoflife.com/wp-content/uploads/2016/08/szechuan-shrimp-13.jpg","id":0,"date":"1/19/2020, 12:20:10 PM"},{"title":"Chef John's Chicken Tikka Masala","name":"chicken thighs","amount":"1 1/2 pounds","notes":"skinless","nameTwo":"garam masala","amountTwo":"2 tsp","notesTwo":"","nameThree":"garlic","amountThree":"4 cloves","notesThree":"finely grated","instructions":"Place chicken in a bowl and drizzle vegetable oil over chicken; toss to coat.\r\n\r\nWhisk kosher salt, garam masala, ground cumin, ground coriander, smoked paprika, ground turmeric, black pepper, cayenne pepper, and cardamom together in a small bowl. Season chicken with spice mixture and turn to coat evenly.\r\n\r\nMelt clarified butter in a large, heavy skillet over high heat. Cook chicken thighs in hot butter until browned on all sides, 5 to 10 minutes. Transfer chicken to a plate. When cool enough to handle, cut chicken into bite-size pieces.\r\n\r\nReduce heat under the skillet to medium-high. Stir onion into skillet; saute until onion softens and turns translucent, 5 to 6 minutes. Add tomato paste and stir. Saute until paste caramelizes, about 5 minutes. Stir garlic and ginger into tomato-onion mixture and cook until fragrant, about 1 minute.\r\n\r\nPour the crushed tomatoes into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Pour in coconut milk and chicken broth; bring to a simmer, reduce heat to medium low, and cook, stirring occasionally, until flavors blend and sauce is slightly reduced, about 15 minutes.\r\n\r\nStir chicken, any accumulated juices from the chicken, cilantro, and red pepper flakes into tomato mixture; bring to a simmer, reduce heat to medium-low, and cook until chicken is cooked through and tender, 10 to 15 minutes. Season with salt and black pepper.","image":"https://i.ytimg.com/vi/lnRmIKkGCIA/maxresdefault.jpg","id":1,"date":"1/19/2020, 12:22:26 PM"},{"title":"Best Lasagne","name":"italian sausage","amount":"1 pound","notes":"","nameTwo":"ground beef","amountTwo":"3/4 pound","notesTwo":"lean","nameThree":"lasagne noodles","amountThree":"12","notesThree":"","instructions":"In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.\r\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.\r\nPreheat oven to 375 degrees F (190 degrees C).\r\nTo assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.\r\nBake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.","image":"https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fi.ytimg.com%2Fvi%2F2qLwkT1F4Lc%2Fmaxresdefault.jpg&f=1&nofb=1","id":2,"date":"1/19/2020, 12:25:27 PM"},{"title":"Mexican Quesadilla Casserole","name":"ground beef","amount":"1 pound","notes":"","nameTwo":"cheddar cheese","amountTwo":"2 cups","notesTwo":"","nameThree":"flour tortillas","amountThree":"6","notesThree":"","instructions":"Preheat oven to 350 degrees F (175 degrees C). Prepare a 13x9-inch baking dish with cooking spray.\r\nHeat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until beef is completely browned, 5 to 7 minutes; drain and discard grease.\r\nStir tomato sauce, black beans, diced tomatoes with lime juice and cilantro, corn, and chopped green chiles into the ground beef mixture; season with chili powder, cumin, garlic, oregano, and red pepper flakes. Reduce heat to low and cook mixture at a simmer for 5 minutes.\r\nSpread about 1/2 cup beef mixture into the bottom of the prepared baking dish; top with 3 tortillas, overlapping as needed. Spread another 1/2 cup beef mixture over the tortillas. Sprinkle 1 cup Cheddar cheese over beef. Finish with layers of remaining tortillas, beef mixture, and Cheddar cheese, respectively.\r\nBake in preheated oven until heated throughout and the cheese is melted, about 15 minutes. Cool 5 minutes before serving.","image":"https://brooklynfarmgirl.com/wp-content/uploads/2019/08/Quesadilla-Casserole_17.jpg","id":3,"date":"1/19/2020, 12:26:51 PM"},{"title":"Curried Coconut Chicken","name":"chicken breast","amount":"2","notes":"boneless","nameTwo":"curry powder","amountTwo":"2 tbsp","notesTwo":"","nameThree":"onion","amountThree":"1/2","notesThree":"thinly sliced","instructions":"Season chicken pieces with salt and pepper.\r\n\r\nHeat oil and curry powder in a large skillet over medium-high heat for two minutes. Stir in onions and garlic, and cook 1 minute more. Add chicken, tossing lightly to coat with curry oil. Reduce heat to medium, and cook for 7 to 10 minutes, or until chicken is no longer pink in center and juices run clear.\r\n\r\nPour coconut milk, tomatoes, tomato sauce, and sugar into the pan, and stir to combine. Cover and simmer, stirring occasionally, approximately 30 to 40 minutes.","image":"https://draxe.com/wp-content/uploads/2015/10/Thai-Chicken-Soup-Final-2.jpg","id":4,"date":"1/19/2020, 12:28:31 PM"}],"ingredients":[{"ingredient":{"name":"cooked shrimp","amount":"12 ounces ","notes":"tails removed"},"ingredientTwo":{"name":"garlic","amount":"4 cloves","notes":"minced"},"ingredientThree":{"name":"water","amount":"4 tbsp","notes":""}},{"ingredient":{"name":"chicken thighs","amount":"1 1/2 pounds","notes":"skinless"},"ingredientTwo":{"name":"garam masala","amount":"2 tsp","notes":""},"ingredientThree":{"name":"garlic","amount":"4 cloves","notes":"finely grated"}},{"ingredient":{"name":"italian sausage","amount":"1 pound","notes":""},"ingredientTwo":{"name":"ground beef","amount":"3/4 pound","notes":"lean"},"ingredientThree":{"name":"lasagne noodles","amount":"12","notes":""}},{"ingredient":{"name":"ground beef","amount":"1 pound","notes":""},"ingredientTwo":{"name":"cheddar cheese","amount":"2 cups","notes":""},"ingredientThree":{"name":"flour tortillas","amount":"6","notes":""}},{"ingredient":{"name":"chicken breast","amount":"2","notes":"boneless"},"ingredientTwo":{"name":"curry powder","amount":"2 tbsp","notes":""},"ingredientThree":{"name":"onion","amount":"1/2","notes":"thinly sliced"}}]}
