{"listOfRecipe":[{"id":1,"title":"Smoked Salmon Pasta","ingredients":["1 lb. spaghetti","1/2 red onion, chopped","2 cloves garlic, minced","1/4 c. white wine","3/4 c. heavy cream","Juice of 1/2 lemon","Kosher salt","Freshly ground black pepper","1/2 lb. smoked salmon, cut into bite size pieces","1/4 c. capers, drained","2 tbsp. freshly chopped dill, plus more for garnish"],"instructions":["In a large pot of salted boiling water, cook pasta according to package directions until al dente. Drain, reserving ½ cup pasta water, and return to pot.","In a large skillet over medium heat, heat oil. Add onion and cook until soft, 5 minutes, then add garlic and cook until fragrant, 1 minute more. Add wine and cook until almost completely reduced, 5 minutes. Add heavy cream and lemon juice and cook until thickened, another 5 minutes. Season with salt and pepper. ","Add salmon, capers, and dill and cook until salmon is warmed through, 2 minutes, then toss sauce and pasta together. Add ¼ cup pasta water if sauce is too thick. Garnish with more dill to serve.",""],"_locals":{}},{"id":2,"title":"Cacio e Pepe","ingredients":["1/2 lb. pasta","2 tbsp. butter, divided","1 tbsp. extra-virgin olive oil ","Coarsely ground black pepper","3/4 c. freshly grated Pecorino, plus more for garnish ","3/4 c. freshly grated Parmesan, plus more for garnish"],"instructions":["In a pot of boiling salted water, cook pasta according to package instructions until al dente. Reserve ⅔ cup pasta water and drain pasta.","In a large skillet over medium heat, melt 1 tablespoon butter with oil. Add a generous amount of black pepper and toast until fragrant, about 1 minute.","Add ⅓ cup reserved pasta water and bring to simmer. Whisk in butter then, using tongs, toss pasta into butter mixture.","Add cheeses and toss constantly until cheese is melty, removing skillet from heat when about half the cheese has melted. (If sauce is too thick, loosen with more pasta water.)"],"_locals":{}},{"id":3,"title":"Lasagna Roll-Ups","ingredients":["1/2 (1-lb.) box lasagna noodles","1 tbsp. extra virgin olive oil","1/2 large onion, chopped","3 cloves garlic, minced","Kosher salt","Freshly ground black pepper","1/2 tsp. red pepper flakes","10 oz. baby spinach","1 tsp. lemon zest","2 c. ricotta","1 large egg","1 c. freshly grated Parmesan, divided","1 c. marinara","2 c. mozzarella"],"instructions":["Preheat oven to 350º. Bring a large pot of salted boiling water to a boil and cook lasagna noodles until al dente. Drain.","In a large skillet over medium heat, heat oil. Add onion and garlic and season with salt, pepper, and red pepper flakes. Cook until onions are soft, about 5 minutes. Add spinach and cook until wilted. Stir in lemon zest and remove from heat.","In a large bowl, stir ricotta, egg, and 1/2 cup Parmesan until combined then season with salt and pepper.","Spread ricotta mixture onto one side of each lasagna noodle. Top with marinara and cooked spinach, then sprinkle with mozzarella and roll up tightly.","In a large deep baking dish, spoon a layer of marinara on bottom of dish. Add the roll-ups and spoon more sauce onto each roll-up. Sprinkle more mozzarella and Parmesan over each roll up. Bake until bubbly and melted, about 20 minutes.","Garnish with parsley before serving."],"_locals":{}},{"id":"4","title":"Goulash","ingredients":["2 tbsp. extra-virgin olive oil","1 medium yellow onion, chopped","2 cloves garlic, minced","1 lb. ground beef","Kosher salt","Freshly ground black pepper","1 tbsp. tomato paste","1 1/4 c. low-sodium beef broth","1 (15-oz.) can tomato sauce","1 (15-oz.) can diced tomatoes","1 tsp. Italian seasoning","1 tsp. paprika","1 1/2 c. elbow macaroni, uncooked","1 c. shredded cheddar","Freshly chopped parsley, for garnish"],"instructions":["In a large skillet over medium heat, heat oil. Add onion and cook until soft, about 5 minutes. Add garlic and cook until fragrant, about 1 minute more.","Add ground beef and cook until no longer pink, about6 minutes. Drain fat and return to pan. Season with salt and pepper.","Add tomato paste and stir to coat, then pour in broth, tomato sauce, and diced tomatoes. Season with Italian seasoning and paprika, and stir in macaroni. Bring to a simmer and cook, stirring occasionally, until pasta is tender, about 15 minutes.","Stir in cheese and remove from heat. Garnish with parsley before serving. "],"_locals":{}},{"id":"5","title":"Fettuccine Alfredo","ingredients":["kosher salt","1 lb. fettuccine","1/2 c. heavy cream","1/2 c. butter","1/2 c. freshly grated Parmesan, plus more for sprinkling","Freshly ground black pepper","2 tbsp. chopped parsley"],"instructions":["In a large pot of boiling salted water, cook pasta according to package instructions. Reserve about 1 cup of pasta water then drain.","Meanwhile, in a large skillet over medium heat, add cream and butter. Cook until the butter is melted and the cream is heated through. Whisk in Parmesan and season with salt and pepper. If the sauce is too thick, add reserved pasta water, 1 tablespoon at a time. Remove from heat.","Add cooked pasta and toss until coated in sauce. Garnish with parsley and serve immediately."],"_locals":{}},{"id":"6","title":"Pasta Carbonara","ingredients":["12 oz. spaghetti","Kosher salt","3 large eggs","1 c. freshly grated Parmesan","8 slices bacon","2 cloves garlic, minced","Freshly ground black pepper","Extra-virgin olive oil (optional), for garnish","Flaky sea salt (optional), for garnish","Freshly chopped parsley, for garnish"],"instructions":["In a large pot of salted boiling water, cook spaghetti according to package directions until al dente. Drain, reserving 1 cup pasta water.","In a medium bowl, whisk eggs and Parmesan until combined. ","Meanwhile, in a large skillet over medium heat, cook bacon until crispy, about 8 minutes. Reserve fat in skillet and transfer slices to a paper towel-lined plate to drain. ","To the same skillet, add garlic and cook until fragrant, about 1 minutes. Add cooked spaghetti and toss until fully coated in bacon fat. Remove from heat. Pour over egg and cheese mixture and stir vigorously until creamy (be careful not to scramble eggs). Add pasta water a couple tablespoons a time to loosen sauce if necessary. ","Season generously with salt and pepper and stir in cooked bacon.","Drizzle with olive oil and garnish with flaky sea salt, Parmesan, and parsley before serving. "],"_locals":{}},{"id":"7","title":"Meatballs Spaghetti","ingredients":["1 lb. spaghetti","1 lb. ground beef","1/3 c. breadcrumbs","1/4 c. finely chopped parsley","1/4 c. freshly grated Parmesan, plus more for serving","1 egg","2 garlic cloves, minced","1 tsp. Kosher salt","1/2 tsp. red pepper flakes","2 tbsp. olive oil, divided","1/2 c. onion, finely chopped","1 (35-oz.) can crushed tomatoes in puree","1 bay leaf","Freshly ground black pepper"],"instructions":["In a large pot of boiling salted water, cook spaghetti according to package instructions. Drain. ","In a large bowl, combine beef with breadcrumbs, parsley, parmesan, egg, garlic, 1 teaspoon salt, and red pepper flakes. Mix until just combined  then form into 16 balls.","In a large pot over medium heat, add 1 tablespoon oil. Add meatballs and cook, turning occasionally, until browned on all sides, about 10 minutes. Remove meatballs and reserve on plate.","Add the remaining oil and onion and cook until onion is soft, 5 minutes. Add crushed tomatoes and bay leaf. Season with salt and pepper and bring to a simmer. Add the meatballs back into the pot, cover and simmer until the sauce has thickened, 8 to 10 minutes.","Serve pasta with a healthy scoop of meatballs and sauce. Top with Parmesan before serving."],"_locals":{}},{"id":"8","title":"Pasta Fagioli","ingredients":["2 tbsp. extra-virgin olive oil","1/2 lb. spicy (or sweet) Italian sausage","1 medium yellow onion, finely chopped","2 medium carrots, peeled and finely chopped","2 stalks celery, finely chopped","3 cloves garlic, minced","kosher salt","Freshly ground black pepper","2 (15-oz.) cans Great Northern Beans","1 (15-oz.) can diced tomatoes","4 c. Swanson Chicken Broth","2 sprigs rosemary, leaves finely chopped","1 1/2 c. ditalini pasta (or other small shape)","Freshly grated Parmesan, for garnish","Freshly chopped parsley, for garnish"],"instructions":["In a large, deep pot over medium heat, heat oil. Add sausage and cook, breaking up with a wooden spoon, until cooked through, about 5 minutes. Stir in onion, carrots, and celery and cook until slightly softened, about 5 minutes.","Add garlic and cook until fragrant, 1 minute more. Season with salt and pepper, then add in beans (with their liquid), diced tomatoes, chicken broth, and rosemary. Bring to a boil, then stir in ditalini.","Reduce heat to medium and cook until pasta is al dente, about 8 minutes. Taste and adjust seasoning if necessary.","Serve in bowls garnished with Parmesan and parsley."],"_locals":{}},{"id":"9","title":"Chicken Alfredo","ingredients":["2 tbsp. extra-virgin olive oil","2 boneless skinless chicken breasts","Kosher salt","Freshly ground black pepper","1 1/2 c. whole milk","1 1/2 c. low-sodium chicken broth","2 cloves garlic, minced","8 oz. fetuccini","1/2 c. heavy cream","1 c. freshly grated Parmesan","Freshly chopped parsley, for garnish "],"instructions":["In a large skillet over medium-high heat, heat oil. Add chicken and season with salt and pepper. Cook until golden and cooked through, 8 minutes per side. Let rest 10 minutes, then slice. ","Add milk, broth, and garlic to skillet. Season with salt and pepper and bring to a simmer. Add fettuccine, stirring frequently for about 3 minutes. Let cook until al dente, 8 minutes more. ","Stir in heavy cream and Parmesan until combined. Simmer until sauce thickens. ","Remove from heat and stir in sliced chicken. Garnish with parsley. "],"_locals":{}},{"id":10,"title":"Baked Shrimp Scampi","ingredients":["1 1/2 lb. shrimp, peeled and deveined","3 tbsp. chopped parsley, divided","2 tbsp. melted butter","2 tbsp. white wine","Juice and zest of 1 lemon","1 shallot, minced","2 cloves garlic, minced","Pinch of crushed red pepper flakes","Kosher salt","Freshly ground black pepper","1/2 c. panko bread crumbs","2 tbsp. extra-virgin olive oil","3/4 lb. cooked angel hair pasta, for serving","Sliced crusty bread, toasted"],"instructions":["Preheat oven to 425°. In a large baking dish, combine shrimp, 2 tablespoons parsley, butter, white wine, lemon juice and zest, shallot, garlic, and red pepper flakes. Season with salt and pepper.","In a medium bowl, mix panko with olive oil and remaining tablespoon parsley. Season with salt and pepper. Sprinkle panko mixture over shrimp. Bake until the shrimp is cooked through and bread crumbs are golden and crispy, 12 to 15 minutes, depending on the size of the shrimp.","Serve warm shrimp over pasta with a squeeze of lemon and bread on the side. (The bread is perfect for dunking in all the buttery juices!)"],"_locals":{}},{"id":"11","title":"Ravioli Lasagna\r\nRavioli Lasagna","ingredients":["1 lb. ground beef","1/2 medium onion, chopped","Kosher salt","Freshly ground black pepper","2 cloves garlic, minced","1 oz. (32-oz.) jar marinara","16 oz. whole milk ricotta","1 large egg","1 c. freshly grated Parmesan, divided","1/4 c. freshly chopped basil, plus more for garnish","1 tsp. garlic powder","2 oz. (12-oz.) packages frozen cheese ravioli","2 c. shredded mozzarella"],"instructions":["Preheat oven to 350º and grease a 9”-x-13” baking dish with cooking spray. Warm a large, nonstick skillet over medium heat and add ground beef and onion. Season with salt and pepper and cook until beef is browned and onion is soft, about 10 minutes, then drain fat and return to skillet. Stir in garlic and marinara, then reduce heat and simmer for flavors to meld, 5 minutes.","Meanwhile, in a medium bowl, add ricotta, egg, 1/4 cup Parmesan, basil, garlic powder, and season with salt and pepper. Stir to combine. ","Spread 1/3 of the meat sauce into prepared pan. Top with a single layer of ravioli, half of the remaining meat sauce, half of the ricotta mixture, and half of the mozzarella and remaining Parmesan. Repeat layers, ending on cheeses. ","Cover pan loosely with aluminum foil and bake for 30 minutes. Remove foil and bake until golden and bubbly, 15 minutes more. Sprinkle with remaining basil and serve."],"_locals":{}}]}
