{"recipes":[{"id":"1","title":" Salmon fish fingers with chunky chips","ingredients":"2 potatoes   cut into wedges (see tip below) 2 tbsp oil 1 large egg  , beaten 100g breadcrumbs, made from day-old bread ½ tsp sweet smoked paprika  4 salmon   fillets (go for the thick ones), each cut into 3 strips drizzle of oil favourite vegetables, to serve","instructions":"Heat oven to 200C/180C fan/gas 6. Put the potato wedges on the baking sheet. Drizzle over 1 tbsp oil and toss the potatoes in it. Season lightly or leave it out altogether for young children. Cook in the oven for 20 mins, turning them halfway through.  Meanwhile, put the beaten egg into a shallow bowl. Tip the breadcrumbs onto a plate. Mix the sweet smoked paprika into the breadcrumbs along with a little seasoning if you like.  Brush a non-stick baking sheet with the remaining oil. Dip the fish strips into the egg, then coat them with the breadcrumbs. Transfer to the baking sheet. Bake for 25 mins until golden. The fish fingers are very delicate so lift them carefully off the tray with a spatula. Serve with their favourite vegetables and the chunky chips. You can open freeze the fish fingers on a baking tray, then once frozen transfer to a freezer bag. Cook from frozen at 200C/180C fan/gas 6 for 20 – 25 mins until crisp and cooked all the way through."},{"id":"2","title":"Mini shepherd’s pies","ingredients":"1 tbsp rapeseed oil  1 onion  , chopped 2 garlic cloves, crushed 2 carrots  , peeled and diced 1 stick celery  , diced 1 yellow pepper  , diced pinch of cumin  250g lean lamb mince (10% fat) 1 courgette  , diced 2 tbsp tomato purée 400ml low salt beef stock (we used Kallo for gluten-free pies, see tip below) 100g lentils  , thoroughly rinsed 1.2kg Maris Piper potatoes 50g butter  75ml milk  60g grated cheddar","instructions":"Heat the oil in a medium saucepan, add the onion and cook for around 5 mins until softened. Stir in the garlic, carrots, celery, pepper and cumin. Cook for a further two mins, then add the lamb. Brown the meat, tipping off any excess fat. Add the courgette and tomato purée, then fry for a few mins more. Pour in the stock, add the lentils and bring to a simmer. Cook for 40 mins, stirring from time to time.  Heat the oven to 180C/fan 160C/gas 4. Boil the potatoes for 10-15 mins until tender. Drain, then mash with the butter and milk.  Remove the lamb mixture from the heat and use a stick blender to purée. Stir as you purée, blending down the pieces of vegetables. Spoon into 8 largish individual ramekins. Top with the mash and grated cheese. The pie can now be chilled and frozen for up to a month.   Bake for 30 mins until the top is golden and the mince is bubbling up at the sides. (Cook from frozen at 160C/fan 140C/gas 3 for about 40 mins, then turn up to 180C/fan 160C/gas 4 for 20-30 mins or until golden on top and piping hot in the centre.) Leave to stand for at least 10 mins before serving. Check it has cooled down sufficiently in the centre before giving it to young children."}]}
