{
    "recipes": [{
        "id": 1,
        "contributor": "Shan",
        "name": "Baked Dijon Salmon",
        "description": "This is a wonderful way to prepare fresh salmon fillets in the oven. Be sure to make extra, your family will be begging for more!",
        "photo": "https://images.media-allrecipes.com/userphotos/720x405/877476.jpg",
        "ingredients": ["1/4 cup butter, melted", "3 tablespoons Dijon mustard", "1 1/2 tablespoons honey", "1/4 cup dry bread crumbs", "1/4 cup finely chopped pecan", "4 teaspoons chopped fresh parsley", "4 (4 ounce) fillets salmon", "salt and pepper to taste", "1 lemon, for garnish"],
        "instructions": ["Preheat oven to 400 degrees F (200 degrees C).", "In a small bowl, stir together butter, mustard, and honey. Set aside. In another bowl, mix together bread crumbs, pecans, and parsley.", "Brush each salmon fillet lightly with honey mustard mixture, and sprinkle the tops of the fillets with the bread crumb mixture.", "Bake salmon 12 to 15 minutes in the preheated oven, or until it flakes easily with a fork. Season with salt and pepper, and garnish with a wedge of lemon."]
    }, {
        "id": 2,
        "contributor": "Tim",
        "name": "Cajun Seafood Pasta",
        "description": "This recipe is a hot one, but delicious! If you are weak of tongue, then divide the amounts of peppers in half. Better to add more than spoil your creation! Bay scallops are preferred, but the larger sea scallops can be used if they are cut in half. This dish can also be placed in a casserole dish and placed under the broiler until top turns golden brown!",
        "photo": "https://images.media-allrecipes.com/userphotos/560x315/1045817.jpg",
        "ingredients": ["2 cups heavy whipping cream", "1 tablespoon chopped fresh basil", "1 tablespoon chopped fresh thyme", "2 teaspoons salt", "2 teaspoons ground black pepper", "1 1/2 teaspoons crushed red pepper flakes", "1 teaspoon ground white pepper", "1 cup chopped green onions", "1 cup chopped parsley", "1/2 pound shrimp, peeled and deveined", "1/2 pound scallops", "1/2 cup shredded Swiss cheese", "1/2 cup grated Parmesan cheese", "1 pound dry fettuccine pasta"],
        "instructions": ["Cook pasta in a large pot of boiling salted water until al dente.", "Meanwhile, pour cream into large skillet. Cook over medium heat, stirring constantly, until just about boiling. Reduce heat, and add herbs, salt, peppers, onions, and parsley. Simmer 7 to 8 minutes, or until thickened.", "Stir in seafood, cooking until shrimp is no longer transparent. Stir in cheeses, blending well.", "Drain pasta. Serve sauce over noodles."]
    }, {
        "id": 3,
        "contributor": "Mary",
        "name": "Grandma's Green Bean Casserole",
        "description": "This recipe is much better than the standard mushroom soup and French fried onion version.",
        "photo": "https://images.media-allrecipes.com/userphotos/720x405/29335.jpg",
        "ingredients": ["2 tablespoons butter", "2 tablespoons all-purpose flour", "1 teaspoon salt", "1 teaspoon white sugar", "1/4 cup onion, diced", "1 cup sour cream", "3 (14.5 ounce) cans French style green beans, drained", "2 cups shredded Cheddar cheese", "1/2 cup crumbled buttery round crackers", "1 tablespoon butter, melted"],
        "instructions": ["Preheat oven to 350 degrees F (175 degrees C).", "Melt 2 tablespoons butter in a large skillet over medium heat. Stir in flour until smooth, and cook for one minute. Stir in the salt, sugar, onion, and sour cream. Add green beans, and stir to coat.", "Transfer the mixture to a 2 1/2 quart casserole dish. Spread shredded cheese over the top. In a small bowl, toss together cracker crumbs and remaining butter, and sprinkle over the cheese.", "Bake for 30 minutes in the preheated oven, or until the top is golden and cheese is bubbly."]
    }, {
        "id": 4,
        "contributor": "xX0pandabear0Xx",
        "name": "Garlic Prime Rib",
        "description": "Quick and easy marinade and so tasty, I was trusted with this recipe but I can't keep it to myself!",
        "photo": "https://images.media-allrecipes.com/userphotos/720x405/4370757.jpg",
        "ingredients": ["1 (10 pound) prime rib roast", "10 cloves garlic, minced", "2 tablespoons olive oil", "2 teaspoons salt", "2 teaspoons ground black pepper", "2 teaspoons dried thyme"],
        "instructions": ["Place the roast in a roasting pan with the fatty side up. In a small bowl, mix together the garlic, olive oil, salt, pepper and thyme. Spread the mixture over the fatty layer of the roast, and let the roast sit out until it is at room temperature, no longer than 1 hour.", "Preheat the oven to 500 degrees F (260 degrees C).", "Bake the roast for 20 minutes in the preheated oven, then reduce the temperature to 325 degrees F (165 degrees C), and continue roasting for an additional 60 to 75 minutes. The internal temperature of the roast should be at 135 degrees F (57 degrees C) for medium rare.", "Allow the roast to rest for 10 or 15 minutes before carving so the meat can retain its juices."]
    }]
}