{"recipes":[{"id":1,"title":"Beef Wellington","ingredients":[{"name":"Flat Cap Mushrooms","amount":"400g","notes":"Roughly Chopped"},{"name":"Sea Salt and Freshly Ground Black Pepper","amount":"To taste","notes":""},{"name":"Olive Oil","amount":"Not specified","notes":"For Cooking"},{"name":"Prime Beef Fillet","amount":"750g","notes":""},{"name":"English Mustard","amount":"1 - 2 tablespoons","notes":""},{"name":"Parma Ham","amount":"6 to 8 slices","notes":""},{"name":"Ready-Made Puff Pastry","amount":"500g","notes":""},{"name":"Egg Yolks","amount":"2","notes":"Beaten"}],"instructions":["Put the mushrooms into a food processor with some seasoning and pulse to a rough paste. Scrape the paste into a pan and cook over a high heat for about 10 mins, tossing frequently, to cook out the moisture from the mushrooms. Spread out on a plate to cool.","Heat in a frying pan and add a little olive oil. Season the beef and sear in the hot pan for 30 secs only on each side. (You don’t want to cook it at this stage, just colour it). Remove the beef from the pan and leave to cool, then brush all over with the mustard.","Lay a sheet of cling film on a work surface and arrange the Parma ham slices on it, in slightly overlapping rows. With a palette knife, spread the mushroom paste over the ham, then place the seared beef fillet in the middle. Keeping a tight hold of the cling film from the edge, neatly roll the Parma ham and mushrooms around the beef to form a tight barrel shape. Twist the ends of the cling film to secure. Chill for 15-20 mins to allow the beef to set and keep its shape.","Lay a sheet of cling film on a work surface and arrange the Parma ham slices on it, in slightly overlapping rows. With a palette knife, spread the mushroom paste over the ham, then place the seared beef fillet in the middle. Keeping a tight hold of the cling film from the edge, neatly roll the Parma ham and mushrooms around the beef to form a tight barrel shape. Twist the ends of the cling film to secure. Chill for 15-20 mins to allow the beef to set and keep its shape.","Heat the oven to 200C, 400F, gas 6.","Lightly score the pastry at 1cm intervals and glaze again with beaten egg yolk. Bake for 20 minutes, then lower the oven setting to 180C, 350F, gas 4 and cook for another 15 mins. Allow to rest for 10-15 mins before slicing and serving with the side dishes of your choice. The beef should still be pink in the centre when you serve it."],"img":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/53/2018/09/gordon-ramsay-beef-wellington-920x581.jpg","dateCreated":"10/04/2020"},{"id":2,"title":"Roast Potatoes with Chili and Turmeric","ingredients":[{"name":"Potatoes","amount":"2.5kg","notes":"Maris Piper or similar"},{"name":"Sea Salt and Freshly Ground Black Pepper","amount":"To taste","notes":""},{"name":"Ground Turmeric","amount":"1 1/2 Teaspoon","notes":""},{"name":"Chili Flakes","amount":"To taste","notes":""},{"name":"Olive Oil or Duck Fat","amount":"4 to 5 Tablespoons","notes":""}],"instructions":["Preheat the oven to 200°C/Gas 6. Peel the potatoes, quarter lengthways and place in a large saucepan of salted cold water. Bring to the boil, then lower the heat and simmer for about 8 minutes.","Drain the potatoes in a colander and sprinkle with the turmeric, chilli flakes and some salt and pepper. Toss in the colander to coat evenly, then drizzle with a little of the olive oil and toss again. Leave to steam for 5 minutes","Put the rest of the olive oil in a roasting tray and place in the oven for a few minutes to heat up. Carefully add the potatoes and toss to coat in the oil. Roast for 40–45 minutes, turning a few times, until crisp and golden. Drain on kitchen paper and transfer to a warmed dish to serve."],"img":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/53/2016/05/Gordon-Ramsays-roast-potatoes-with-chilli-and-turmeric-620x408.jpg","dateCreated":"11/04/2020"}]}
