{"recipes":[{"id":"1","title":" Salmon fish fingers with chunky chips","ingredients":"2 potatoes   cut into wedges (see tip below) 2 tbsp oil 1 large egg  , beaten 100g breadcrumbs, made from day-old bread ½ tsp sweet smoked paprika  4 salmon   fillets (go for the thick ones), each cut into 3 strips drizzle of oil favourite vegetables, to serve","instructions":"Heat oven to 200C/180C fan/gas 6. Put the potato wedges on the baking sheet. Drizzle over 1 tbsp oil and toss the potatoes in it. Season lightly or leave it out altogether for young children. Cook in the oven for 20 mins, turning them halfway through.  Meanwhile, put the beaten egg into a shallow bowl. Tip the breadcrumbs onto a plate. Mix the sweet smoked paprika into the breadcrumbs along with a little seasoning if you like.  Brush a non-stick baking sheet with the remaining oil. Dip the fish strips into the egg, then coat them with the breadcrumbs. Transfer to the baking sheet. Bake for 25 mins until golden. The fish fingers are very delicate so lift them carefully off the tray with a spatula. Serve with their favourite vegetables and the chunky chips. You can open freeze the fish fingers on a baking tray, then once frozen transfer to a freezer bag. Cook from frozen at 200C/180C fan/gas 6 for 20 – 25 mins until crisp and cooked all the way through."},{"id":"2","title":"Mini shepherd’s pies","ingredients":"1 tbsp rapeseed oil  1 onion  , chopped 2 garlic cloves, crushed 2 carrots  , peeled and diced 1 stick celery  , diced 1 yellow pepper  , diced pinch of cumin  250g lean lamb mince (10% fat) 1 courgette  , diced 2 tbsp tomato purée 400ml low salt beef stock (we used Kallo for gluten-free pies, see tip below) 100g lentils  , thoroughly rinsed 1.2kg Maris Piper potatoes 50g butter  75ml milk  60g grated cheddar","instructions":"Heat the oil in a medium saucepan, add the onion and cook for around 5 mins until softened. Stir in the garlic, carrots, celery, pepper and cumin. Cook for a further two mins, then add the lamb. Brown the meat, tipping off any excess fat. Add the courgette and tomato purée, then fry for a few mins more. Pour in the stock, add the lentils and bring to a simmer. Cook for 40 mins, stirring from time to time.  Heat the oven to 180C/fan 160C/gas 4. Boil the potatoes for 10-15 mins until tender. Drain, then mash with the butter and milk.  Remove the lamb mixture from the heat and use a stick blender to purée. Stir as you purée, blending down the pieces of vegetables. Spoon into 8 largish individual ramekins. Top with the mash and grated cheese. The pie can now be chilled and frozen for up to a month.   Bake for 30 mins until the top is golden and the mince is bubbling up at the sides. (Cook from frozen at 160C/fan 140C/gas 3 for about 40 mins, then turn up to 180C/fan 160C/gas 4 for 20-30 mins or until golden on top and piping hot in the centre.) Leave to stand for at least 10 mins before serving. Check it has cooled down sufficiently in the centre before giving it to young children."},{"id":"3","title":"Microwave courgette and pea risotto with prawns","ingredients":"200g risotto rice  1 large garlic clove, crushed 2 spring onions  , finely sliced 900ml low-salt chicken stock (we used gluten-free Kallo, see tips below) 120g frozen peas  1 large courgette  , diced (see tips below) 50g grated medium or mature cheddar  , plus extra to serve 140g cooked prawns   (or chicken)","instructions":"Put the rice, garlic and spring onions into a large microwaveable bowl, then pour in 400ml stock. Cover with cling film and microwave on High for 10 mins. Stir the rice, then add another 250ml of the remaining stock, cover and microwave on High again for 3 mins.  Stir the rice again, then add the frozen peas, courgette and the rest of the stock. Cover and microwave on the same setting for a further 8 mins. Stir in the cheese and prawns (or chicken if you prefer), then leave the risotto to stand for 2 mins. Scatter with more cheese and serve."},{"id":"4","title":"Easy fish cakes","ingredients":"1 x pack fish pie mix (cod, salmon, smoked haddock etc, weight around 320g-400g depending on pack size) 3 spring onions  , finely chopped 100ml milk  450g potato  , peeled, large ones cut in half 75g frozen sweetcorn, defrosted handful of grated cheddar   cheese 1 large egg, beaten flour  , for dusting olive oil  , for frying","instructions":"Cook the potatoes in boiling water until just tender. Drain well and return to the pan on a low heat. Heat for another minute or two to evaporate excess liquid. Mash the potato with a small knob of butter. Allow to cool.  Put the fish spring onions and milk in a shallow dish, cover with cling film and cook in the microwave for 1 ½ - 2 mins until just cooked. If you don’t have a microwave, put everything in a saucepan and gently cook until just opaque and cooked through.  Drain the fish and spring onions through a fine sieve. Gently mix through the potatoes, avoiding breaking up the fish too much, along with the sweetcorn, cheddar and a generous grind of black pepper. Form into 6 - 8 patties. The cooler the mash potato is when you do this, the easier it will be to form the patties as the mixture will be very soft when warm.  Pour the egg on one plate and scatter flour on the other. Dip the patties in egg and then flour and arrange on a sheet of baking paper on a tray. Put the patties in the fridge for at least half an hour to firm up if the patties feel very soft. At this point you can freeze the patties, wrapped individually. Defrost throughly before moving onto the next stage.  Heat a large frying pan with a generous glug of olive oil. When the oil is hot, carefully lower the fish cakes into the pan. Cook for 5 - 7 minutes or until golden brown underneath and then carefully flip them over. Fry for another 5 - 7 minutes or until golden on the bottom and heated all the way through."},{"id":"5","title":"Easy beef stew with sweet potato topping","ingredients":"1 tbsp olive oil  1 onion  , finely chopped 2 carrots  , finely diced (about 130g) 1-2 sticks celery  , finely diced (about 130g) 2 fat cloves garlic  , crushed 400-500g braising steak 1 tsp ground cinnamon 1 low-salt beef stock cube 2 tbsp tomato purée 1 x 25g pack parsley  , stalks and leaves finely chopped separately 1kg sweet potatoes  , peeled and diced knob of butter  handful grated cheddar","instructions":"Heat the olive oil in a heavy-based pan. Add the onions and cook for 2 mins, then add the carrot and celery and cook until softened. Add a little water if the mixture sticks.  Add the braising steak and cook until browned, then stir in the garlic and cinnamon and cook for a further 1 – 2 mins until the aromas are released.  Add the stock cube to 500ml boiling water and stir into the meat, along with the tomato purée and parsley stalks. Bring to the boil and simmer covered for 1 hour, then take off the lid and simmer for another hour or until the meat is very tender. Stir in the chopped parsley leaves.  Transfer the stew into a medium-sized ceramic dish (that would be big enough for four adults), or into 6 - 8 large ramekins for make-ahead toddler portions.  Meanwhile, steam or boil the sweet potatoes until tender. Preheat the oven to 200C/ 180C fan/ gas mark 6. Drain the potatoes well and mash with the butter. Spoon on top of the meat, sprinkle with the cheese and cook on the top shelf for around 20 minutes until golden and bubbling.  Alternatively, cover and freeze the pie or mini pies for another time. Defrost thoroughly before cooking - you can do this by leaving it in the fridge overnight if you like. Preheat the oven to 200C/ 180C fan/ gas mark 6 and cook for around 30 - 35 mins or until golden, bubbling and hot throughout."},{"id":"6","title":"Easy lamb tagine","ingredients":"2 tbsp olive oil  1 onion  , finely diced 2 carrots  , finely diced (about 150g) 500g diced leg of lamb 2 fat cloves garlic  , crushed ½ tsp cumin  ½ tsp ground ginger ¼ tsp saffron   strands 1 tsp ground cinnamon 1 tbsp clear honey 100g soft dried apricot, quartered 1 low-salt vegetable stock cube 1 small butternut squash, peeled, seeds removed and cut into 1cm dice steamed couscous   or rice, to serve chopped parsley   and toasted pine nuts, to serve (optional)","instructions":"Heat the olive oil in a heavy-based pan and add the onion and carrot. Cook for 3- 4 mins until softened.  Add the diced lamb and brown all over. Stir in the garlic and all the spices and cook for a few mins more or until the aromas are released.  Add the honey and apricots, crumble in the stock cube and pour over roughly 500ml boiling water or enough to cover the meat. Give it a good stir and bring to the boil. Turn down to a simmer, put the lid on and cook for 1 hour.  Remove the lid and cook for a further 30 mins, then stir in the squash. Cook for 20 – 30 mins more until the squash is soft and the lamb is tender. Serve alongside rice or couscous and sprinkle with parsley and pine nuts, if using."}]}
